# — — — — — — — Задание №1 — — — — — —
print('Hello, World!')

print('Маша + Петя = Любовь')

print('х = 3 + 4')

print(3 + 4)

# — — — — — — — Задание №2 — — — — — —

print(type('Hello, World!'))

print(type(3 + 4))

print(type(7 / 4))

print(type([1, 2, 5, 10, 100]))

# — — — — — — — Задание №3 — — — — — —

x = 3

y = (((x ** 3) ** 0.5)/((x ** 3) + 3/x)) * (4 * (x ** 7) + x ** 5) + 80 * (27 * (x ** 4) + 12 * (x ** 3) - 5 * (x ** 2) + 10)

print(y)

y = ((3 % 2) + ((4,32 * 16,7) // 1000)) / (14,5 +   


# — — — — — — — Задание №4 — — — — — —